{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "85a4e051",
   "metadata": {},
   "source": [
    "## Yandex Algo 5.0"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9ff3a30f",
   "metadata": {},
   "source": [
    "____\n",
    "\n",
    "## Неделя 3\n",
    "____"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8083a6aa",
   "metadata": {},
   "source": [
    "### A. Плейлисты\n",
    "\n",
    "Ограничение времени \t1.5 секунд\n",
    "Ограничение памяти \t256Mb\n",
    "\n",
    "Ввод \tстандартный ввод или input.txt\n",
    "Вывод \tстандартный вывод или output.txt\n",
    "\n",
    "Костя успешно прошел собеседование и попал на стажировку в отдел разработки сервиса «Музыка».\n",
    "\n",
    "Конкретно ему поручили такое задание — научиться подбирать плейлист для группы друзей, родственников или коллег. При этом нужно подобрать такой плейлист, в который входят исключительно нравящиеся всем членам группы песни.\n",
    "\n",
    "Костя очень хотел выполнить это задание быстро и качественно, но у него не получается. Помогите ему написать программу, которая составляет плейлист для группы людей.\n",
    "\n",
    "**Формат ввода**\n",
    "В первой строке расположено одно натуральное число n(1≤n≤2⋅105), где n – количество человек в группе.\n",
    "\n",
    "В следующих 2⋅n строках идет описание любимых плейлистов членов группы. По 2 строки на каждого участника.\n",
    "\n",
    "В первой из этих 2-х строк расположено число ki — количество любимых треков i-го члена группы. В следующей строке расположено ki строк через пробел — названия любимых треков i-го участника группы.\n",
    "\n",
    "Каждый трек в плейлисте задан в виде строки, все строки уникальны, сумма длин строк не превосходит 2⋅106. Строки содержат большие и маленькие латинские буквы и цифры.\n",
    "\n",
    "**Формат вывода**\n",
    "Выведите количество, а затем сам список песен через пробел — список треков, которые нравятся каждому участнику группы. Ответ необходимо отсортировать в лексикографическом порядке!\n",
    "\n",
    "**Пример 1**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "1\n",
    "2\n",
    "GoGetIt Life\n",
    "\n",
    "2\n",
    "GoGetIt Life \n",
    "\n",
    "**Пример 2**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "2\n",
    "2\n",
    "Love Life\n",
    "2\n",
    "Life GoodDay\n",
    "\n",
    "1\n",
    "Life \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5f38dc5f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n",
      "a c\n"
     ]
    }
   ],
   "source": [
    "# with open('yandex algo tests/A3_primer.txt') as f:\n",
    "# with open('yandex algo tests/A3_primer_2.txt') as f:\n",
    "with open('yandex algo tests/05 (3)') as f:\n",
    "# with open('input.txt') as f:      \n",
    "    content = f.readlines()\n",
    "\n",
    "n = int(content[0])\n",
    "\n",
    "#FIRST MEMBER's TRACKS\n",
    "acceptable_tracks = set(content[2].split())\n",
    "\n",
    "for member in range(2, 2*n+1, 2):\n",
    "    memb_trcks = set(content[member].split())\n",
    "    acceptable_tracks = acceptable_tracks.intersection(memb_trcks)\n",
    "\n",
    "acceptable_tracks_sorted = list(acceptable_tracks)\n",
    "acceptable_tracks_sorted.sort()\n",
    "playlist_size = len(acceptable_tracks)\n",
    "\n",
    "print(playlist_size)\n",
    "print(' '.join(acceptable_tracks_sorted))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d015eea1",
   "metadata": {},
   "source": [
    "### B. Анаграмма?\n",
    "\n",
    "Ограничение времени \t1 секунда\n",
    "Ограничение памяти \t64Mb\n",
    "\n",
    "Ввод \tстандартный ввод или input.txt\n",
    "Вывод \tстандартный вывод или output.txt\n",
    "\n",
    "Задано две строки, нужно проверить, является ли одна анаграммой другой. Анаграммой называется строка, полученная из другой перестановкой букв.\n",
    "\n",
    "**Формат ввода**\n",
    "\n",
    "Строки состоят из строчных латинских букв, их длина не превосходит 100000. Каждая записана в отдельной строке.\n",
    "\n",
    "**Формат вывода**\n",
    "\n",
    "Выведите \"YES\" если одна из строк является анаграммой другой и \"NO\" в противном случае.\n",
    "\n",
    "**Пример 1**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "dusty\n",
    "study\n",
    "\n",
    "YES\n",
    "\n",
    "**Пример 2**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "rat\n",
    "bat\n",
    "\n",
    "NO\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "67e97cab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "rat\n",
      "bat\n",
      "NO\n"
     ]
    }
   ],
   "source": [
    "a = input()\n",
    "b = input()\n",
    "\n",
    "dict_1 = {}\n",
    "dict_2 = {}\n",
    "\n",
    "for letter in a:\n",
    "    if letter in dict_1:\n",
    "        dict_1[letter] = dict_1[letter] + 1\n",
    "    else:\n",
    "        dict_1[letter] = 1\n",
    "        \n",
    "for letter in b:\n",
    "    if letter in dict_2:\n",
    "        dict_2[letter] = dict_2[letter] + 1\n",
    "    else:\n",
    "        dict_2[letter] = 1\n",
    "\n",
    "answer = 'YES'        \n",
    "        \n",
    "for key, value in dict_1.items():\n",
    "    if key not in dict_2:\n",
    "        answer = 'NO'\n",
    "    elif value != dict_2[key]:\n",
    "        answer = 'NO'\n",
    "        \n",
    "for key, value in dict_2.items():\n",
    "    if key not in dict_1:\n",
    "        answer = 'NO'\n",
    "    elif value != dict_1[key]:\n",
    "        answer = 'NO'\n",
    "        \n",
    "print(answer)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "60575101",
   "metadata": {},
   "source": [
    "### C. Удаление чисел\n",
    "\n",
    "Ограничение времени \t1 секунда\n",
    "Ограничение памяти \t256Mb\n",
    "\n",
    "Ввод \tстандартный ввод или input.txt\n",
    "Вывод \tстандартный вывод или output.txt\n",
    "\n",
    "Дан массив a из n чисел. Найдите минимальное количество чисел, после удаления которых попарная разность оставшихся чисел по модулю не будет превышать 1, то есть после удаления ни одно число не должно отличаться от какого-либо другого более чем на 1.\n",
    "\n",
    "**Формат ввода**\n",
    "Первая строка содержит одно целое число n (1≤n≤2⋅105) — количество элементов массива a.\n",
    "\n",
    "Вторая строка содержит n целых чисел a1,a2,…,an (0≤ai≤105) — элементы массива a.\n",
    "\n",
    "**Формат вывода**\n",
    "Выведите одно число — ответ на задачу.\n",
    "\n",
    "**Пример 1**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "5\n",
    "1 2 3 4 5\n",
    "\n",
    "3\n",
    "\n",
    "**Пример 2**\n",
    "Ввод\n",
    "Вывод\n",
    "\n",
    "10\n",
    "1 1 2 3 5 5 2 2 1 5\n",
    "\n",
    "4\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84b520e6",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
